[
    {
        "name": "Grilled Teriyaki Shrimp and Pineapple Skewers",
        "description": "These simple savory-sweet shrimp and pineapple skewers are basted with a homemade teriyaki sauce and cook up in just a few minutes on the grill.",
        "ingredients": [
            "⅓ cup water",
            "2 tablespoons soy sauce",
            "2 tablespoons brown sugar",
            "1 teaspoon honey",
            "1 teaspoon grated fresh garlic",
            "1 teaspoon grated fresh ginger",
            "1 pound jumbo shrimp",
            "½ fresh pineapple, cored and cut into 1 1/2-inch pieces",
            "skewers",
            "2 tablespoons minced fresh cilantro (Optional)",
            "1 tablespoon toasted sesame seeds (Optional)"
        ],
        "instructions": [
            "Combine water, soy sauce, brown sugar, honey, garlic, and ginger in a small saucepan and bring to a boil over medium-high heat. Reduce heat to medium-low and simmer until sauce has reduced and thickened slightly, 8 to 10 minutes.",
            "Preheat an outdoor grill for medium-high heat and lightly oil grate. Thread shrimp and pineapple alternately onto skewers and place on a platter.",
            "Arrange skewers on the hot grate. Grill 2 to 3 minutes per side, or until shrimp is opaque and cooked through. Turn grill to low heat and brush sauce on both sides of skewers. Transfer to a serving platter and sprinkle with cilantro and sesame seeds."
        ],
        "tags": [],
        "time": {
            "prep": "25 mins ",
            "cook": "20 mins ",
            "active": "",
            "inactive": "",
            "ready": "",
            "total": "45 mins "
        },
        "servings": "4",
        "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=3888&h=1944&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F6884311.jpg"
    },
    {
        "name": "Irresistible Whole Wheat Challah",
        "description": "A challah made with whole wheat flour and sweetened with honey gets a lift from wheat gluten, and optional extra yumminess from raisins. Recipe makes 2 loaves.",
        "ingredients": [
            "4 cups whole wheat flour",
            "1 teaspoon salt",
            "2 ¼ teaspoons active dry yeast",
            "2 tablespoons vital wheat gluten (Optional)",
            "½ cup honey",
            "½ cup olive oil",
            "1 cup warm water",
            "2 eggs",
            "¼ cup raisins, to taste (Optional)"
        ],
        "instructions": [
            "In a large bowl, stir together the flour, salt, yeast, and vital wheat gluten until well mixed. In another bowl, stir together the honey, olive oil, water, eggs, and raisins. Pour the liquid mixture into the flour mixture, and stir until it forms a dough.",
            "Turn the dough out onto a floured surface, and knead until smooth and elastic, about 10 minutes. Form the dough into a round shape. Lightly oil a bowl, place the dough in the bowl, and turn the dough over a few times to oil the surface. Cover the bowl with a cloth, and let rise in a warm, draft-free place until doubled, about 1 hour.",
            "Punch down the dough, knead it a few times to remove some of the bubbles, and cut it into 2 equal-sized pieces. Set 1 piece of dough aside under a cloth to prevent drying out while you shape or braid the first loaf as desired.",
            "Working on a floured surface, roll the small dough pieces into ropes about the thickness of your thumb and about 12 inches long. Ropes should be fatter in the middle and thinner at the ends. Pinch 3 ropes together at the top and braid them. Starting with the strand to the right, move it to the left over the middle strand (that strand becomes the new middle strand.) Take the strand farthest to the left, and move it over the new middle strand. Continue braiding, alternating sides each time, until the loaf is braided, and pinch the ends together and fold them underneath for a neat look. Repeat for the other loaf, place the braided loaves on a baking sheet lined with parchment paper, and let rise in a warm place until doubled, about 30 minutes.",
            "Preheat oven to 350 degrees F (175 degrees C).",
            "Bake in the preheated oven until golden brown, about 30 minutes. Serve warm for best flavor."
        ],
        "tags": [],
        "time": {
            "prep": "30 mins ",
            "cook": "30 mins ",
            "active": "",
            "inactive": "1 hr 40 mins ",
            "ready": "",
            "total": "1 hr 100 mins "
        },
        "servings": "16",
        "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2260&h=1130&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F1515332.jpg"
    },
    {
        "name": "Italian Sausage Stuffed Shells",
        "description": "Jumbo pasta shells are stuffed with Italian sausage and shredded mozzarella cheese, topped with marinara sauce and more cheese then baked until bubbly and browned.",
        "ingredients": [
            "1 (16 ounce) package jumbo pasta shells",
            "3 teaspoons vegetable oil, divided",
            "1 pound bulk Italian sausage",
            "1 (16 ounce) package finely shredded mozzarella cheese, divided",
            "1 teaspoon dried Italian seasoning, plus more for garnish if desired",
            "1 (24 ounce) jar prepared marinara sauce"
        ],
        "instructions": [
            "Preheat oven to 350 degrees F (175 degrees C). Lightly oil a 9x13 baking dish.",
            "Bring a large pot of lightly salted water to a boil. Cook shells in the boiling water, stirring occasionally until tender yet firm to the bite, about 10 to 12 minutes. Drain. Lightly oil a rimmed baking sheet; place drained pasta on baking sheet to cool.",
            "Heat 2 teaspoons vegetable oil over medium-high heat in a heavy skillet. Cook and crumble sausage until it has lost its pink color and begins to brown. Remove from heat; drain off grease.",
            "Stir half of the shredded cheese and the Italian seasoning into the browned sausage. Spoon mixture into the pasta shells (1 to 2 tablespoons per shell). Arrange stuffed shells in prepared baking dish. Pour marinara sauce evenly over the shells. Top with remaining shredded cheese. Cover tightly with aluminum foil.",
            "Bake in preheated oven until heated through and bubbly, about 30 minutes. Remove foil; bake until browned, 5 to 10 more minutes. Sprinkle with a pinch of Italian seasoning, if desired."
        ],
        "tags": [],
        "time": {
            "prep": "",
            "cook": "",
            "active": "",
            "inactive": "",
            "ready": "",
            "total": ""
        },
        "servings": "8",
        "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=%5B1380%2C550%5D&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F08%2F10%2F246787_ItalianStuffedShells_MFS-WD-2x1-1.jpg"
    }
]